{
  "ir_version": "0.1",
  "tensors": [
    {
      "name": "model.embed_tokens.weight",
      "dtype": "BF16",
      "shape": [
        151936,
        4096
      ],
      "data_offsets": [
        0,
        1244659712
      ]
    },
    {
      "name": "model.layers.0.input_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        1244659712,
        1244667904
      ]
    },
    {
      "name": "model.layers.0.mlp.down_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        12288
      ],
      "data_offsets": [
        1244667904,
        1345331200
      ]
    },
    {
      "name": "model.layers.0.mlp.gate_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        1345331200,
        1445994496
      ]
    },
    {
      "name": "model.layers.0.mlp.up_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        1445994496,
        1546657792
      ]
    },
    {
      "name": "model.layers.0.post_attention_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        1546657792,
        1546665984
      ]
    },
    {
      "name": "model.layers.0.self_attn.k_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        1546665984,
        1546666240
      ]
    },
    {
      "name": "model.layers.0.self_attn.k_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        1546666240,
        1555054848
      ]
    },
    {
      "name": "model.layers.0.self_attn.o_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        1555054848,
        1588609280
      ]
    },
    {
      "name": "model.layers.0.self_attn.q_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        1588609280,
        1588609536
      ]
    },
    {
      "name": "model.layers.0.self_attn.q_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        1588609536,
        1622163968
      ]
    },
    {
      "name": "model.layers.0.self_attn.v_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        1622163968,
        1630552576
      ]
    },
    {
      "name": "model.layers.1.input_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        1630552576,
        1630560768
      ]
    },
    {
      "name": "model.layers.1.mlp.down_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        12288
      ],
      "data_offsets": [
        1630560768,
        1731224064
      ]
    },
    {
      "name": "model.layers.1.mlp.gate_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        1731224064,
        1831887360
      ]
    },
    {
      "name": "model.layers.1.mlp.up_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        1831887360,
        1932550656
      ]
    },
    {
      "name": "model.layers.1.post_attention_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        1932550656,
        1932558848
      ]
    },
    {
      "name": "model.layers.1.self_attn.k_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        1932558848,
        1932559104
      ]
    },
    {
      "name": "model.layers.1.self_attn.k_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        1932559104,
        1940947712
      ]
    },
    {
      "name": "model.layers.1.self_attn.o_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        1940947712,
        1974502144
      ]
    },
    {
      "name": "model.layers.1.self_attn.q_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        1974502144,
        1974502400
      ]
    },
    {
      "name": "model.layers.1.self_attn.q_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        1974502400,
        2008056832
      ]
    },
    {
      "name": "model.layers.1.self_attn.v_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        2008056832,
        2016445440
      ]
    },
    {
      "name": "model.layers.2.input_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        2016445440,
        2016453632
      ]
    },
    {
      "name": "model.layers.2.mlp.down_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        12288
      ],
      "data_offsets": [
        2016453632,
        2117116928
      ]
    },
    {
      "name": "model.layers.2.mlp.gate_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        2117116928,
        2217780224
      ]
    },
    {
      "name": "model.layers.2.mlp.up_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        2217780224,
        2318443520
      ]
    },
    {
      "name": "model.layers.2.post_attention_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        2318443520,
        2318451712
      ]
    },
    {
      "name": "model.layers.2.self_attn.k_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        2318451712,
        2318451968
      ]
    },
    {
      "name": "model.layers.2.self_attn.k_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        2318451968,
        2326840576
      ]
    },
    {
      "name": "model.layers.2.self_attn.o_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        2326840576,
        2360395008
      ]
    },
    {
      "name": "model.layers.2.self_attn.q_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        2360395008,
        2360395264
      ]
    },
    {
      "name": "model.layers.2.self_attn.q_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        2360395264,
        2393949696
      ]
    },
    {
      "name": "model.layers.2.self_attn.v_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        2393949696,
        2402338304
      ]
    },
    {
      "name": "model.layers.3.input_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        2402338304,
        2402346496
      ]
    },
    {
      "name": "model.layers.3.mlp.down_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        12288
      ],
      "data_offsets": [
        2402346496,
        2503009792
      ]
    },
    {
      "name": "model.layers.3.mlp.gate_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        2503009792,
        2603673088
      ]
    },
    {
      "name": "model.layers.3.mlp.up_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        2603673088,
        2704336384
      ]
    },
    {
      "name": "model.layers.3.post_attention_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        2704336384,
        2704344576
      ]
    },
    {
      "name": "model.layers.3.self_attn.k_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        2704344576,
        2704344832
      ]
    },
    {
      "name": "model.layers.3.self_attn.k_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        2704344832,
        2712733440
      ]
    },
    {
      "name": "model.layers.3.self_attn.o_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        2712733440,
        2746287872
      ]
    },
    {
      "name": "model.layers.3.self_attn.q_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        2746287872,
        2746288128
      ]
    },
    {
      "name": "model.layers.3.self_attn.q_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        2746288128,
        2779842560
      ]
    },
    {
      "name": "model.layers.3.self_attn.v_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        2779842560,
        2788231168
      ]
    },
    {
      "name": "model.layers.4.input_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        2788231168,
        2788239360
      ]
    },
    {
      "name": "model.layers.4.mlp.down_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        12288
      ],
      "data_offsets": [
        2788239360,
        2888902656
      ]
    },
    {
      "name": "model.layers.4.mlp.gate_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        2888902656,
        2989565952
      ]
    },
    {
      "name": "model.layers.4.mlp.up_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        2989565952,
        3090229248
      ]
    },
    {
      "name": "model.layers.4.post_attention_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        3090229248,
        3090237440
      ]
    },
    {
      "name": "model.layers.4.self_attn.k_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        3090237440,
        3090237696
      ]
    },
    {
      "name": "model.layers.4.self_attn.k_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        3090237696,
        3098626304
      ]
    },
    {
      "name": "model.layers.4.self_attn.o_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        3098626304,
        3132180736
      ]
    },
    {
      "name": "model.layers.4.self_attn.q_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        3132180736,
        3132180992
      ]
    },
    {
      "name": "model.layers.4.self_attn.q_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        3132180992,
        3165735424
      ]
    },
    {
      "name": "model.layers.4.self_attn.v_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        3165735424,
        3174124032
      ]
    },
    {
      "name": "model.layers.5.input_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        3174124032,
        3174132224
      ]
    },
    {
      "name": "model.layers.5.mlp.down_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        12288
      ],
      "data_offsets": [
        3174132224,
        3274795520
      ]
    },
    {
      "name": "model.layers.5.mlp.gate_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        3274795520,
        3375458816
      ]
    },
    {
      "name": "model.layers.5.mlp.up_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        3375458816,
        3476122112
      ]
    },
    {
      "name": "model.layers.5.post_attention_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        3476122112,
        3476130304
      ]
    },
    {
      "name": "model.layers.5.self_attn.k_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        3476130304,
        3476130560
      ]
    },
    {
      "name": "model.layers.5.self_attn.k_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        3476130560,
        3484519168
      ]
    },
    {
      "name": "model.layers.5.self_attn.o_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        3484519168,
        3518073600
      ]
    },
    {
      "name": "model.layers.5.self_attn.q_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        3518073600,
        3518073856
      ]
    },
    {
      "name": "model.layers.5.self_attn.q_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        3518073856,
        3551628288
      ]
    },
    {
      "name": "model.layers.5.self_attn.v_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        3551628288,
        3560016896
      ]
    },
    {
      "name": "model.layers.6.input_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        3560016896,
        3560025088
      ]
    },
    {
      "name": "model.layers.6.mlp.down_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        12288
      ],
      "data_offsets": [
        3560025088,
        3660688384
      ]
    },
    {
      "name": "model.layers.6.mlp.gate_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        3660688384,
        3761351680
      ]
    },
    {
      "name": "model.layers.6.mlp.up_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        3761351680,
        3862014976
      ]
    },
    {
      "name": "model.layers.6.post_attention_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        3862014976,
        3862023168
      ]
    },
    {
      "name": "model.layers.6.self_attn.k_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        3862023168,
        3862023424
      ]
    },
    {
      "name": "model.layers.6.self_attn.k_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        3862023424,
        3870412032
      ]
    },
    {
      "name": "model.layers.6.self_attn.o_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        3870412032,
        3903966464
      ]
    },
    {
      "name": "model.layers.6.self_attn.q_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        3903966464,
        3903966720
      ]
    },
    {
      "name": "model.layers.6.self_attn.q_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        3903966720,
        3937521152
      ]
    },
    {
      "name": "model.layers.6.self_attn.v_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        3937521152,
        3945909760
      ]
    },
    {
      "name": "model.layers.7.self_attn.k_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        3945909760,
        3954298368
      ]
    },
    {
      "name": "model.layers.7.self_attn.q_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        3954298368,
        3987852800
      ]
    },
    {
      "name": "model.layers.7.self_attn.v_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        3987852800,
        3996241408
      ]
    },
    {
      "name": "model.layers.10.input_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        0,
        8192
      ]
    },
    {
      "name": "model.layers.10.mlp.down_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        12288
      ],
      "data_offsets": [
        8192,
        100671488
      ]
    },
    {
      "name": "model.layers.10.mlp.gate_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        100671488,
        201334784
      ]
    },
    {
      "name": "model.layers.10.mlp.up_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        201334784,
        301998080
      ]
    },
    {
      "name": "model.layers.10.post_attention_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        301998080,
        302006272
      ]
    },
    {
      "name": "model.layers.10.self_attn.k_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        302006272,
        302006528
      ]
    },
    {
      "name": "model.layers.10.self_attn.k_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        302006528,
        310395136
      ]
    },
    {
      "name": "model.layers.10.self_attn.o_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        310395136,
        343949568
      ]
    },
    {
      "name": "model.layers.10.self_attn.q_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        343949568,
        343949824
      ]
    },
    {
      "name": "model.layers.10.self_attn.q_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        343949824,
        377504256
      ]
    },
    {
      "name": "model.layers.10.self_attn.v_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        377504256,
        385892864
      ]
    },
    {
      "name": "model.layers.11.input_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        385892864,
        385901056
      ]
    },
    {
      "name": "model.layers.11.mlp.down_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        12288
      ],
      "data_offsets": [
        385901056,
        486564352
      ]
    },
    {
      "name": "model.layers.11.mlp.gate_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        486564352,
        587227648
      ]
    },
    {
      "name": "model.layers.11.mlp.up_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        587227648,
        687890944
      ]
    },
    {
      "name": "model.layers.11.post_attention_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        687890944,
        687899136
      ]
    },
    {
      "name": "model.layers.11.self_attn.k_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        687899136,
        687899392
      ]
    },
    {
      "name": "model.layers.11.self_attn.k_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        687899392,
        696288000
      ]
    },
    {
      "name": "model.layers.11.self_attn.o_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        696288000,
        729842432
      ]
    },
    {
      "name": "model.layers.11.self_attn.q_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        729842432,
        729842688
      ]
    },
    {
      "name": "model.layers.11.self_attn.q_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        729842688,
        763397120
      ]
    },
    {
      "name": "model.layers.11.self_attn.v_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        763397120,
        771785728
      ]
    },
    {
      "name": "model.layers.12.input_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        771785728,
        771793920
      ]
    },
    {
      "name": "model.layers.12.mlp.down_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        12288
      ],
      "data_offsets": [
        771793920,
        872457216
      ]
    },
    {
      "name": "model.layers.12.mlp.gate_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        872457216,
        973120512
      ]
    },
    {
      "name": "model.layers.12.mlp.up_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        973120512,
        1073783808
      ]
    },
    {
      "name": "model.layers.12.post_attention_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        1073783808,
        1073792000
      ]
    },
    {
      "name": "model.layers.12.self_attn.k_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        1073792000,
        1073792256
      ]
    },
    {
      "name": "model.layers.12.self_attn.k_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        1073792256,
        1082180864
      ]
    },
    {
      "name": "model.layers.12.self_attn.o_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        1082180864,
        1115735296
      ]
    },
    {
      "name": "model.layers.12.self_attn.q_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        1115735296,
        1115735552
      ]
    },
    {
      "name": "model.layers.12.self_attn.q_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        1115735552,
        1149289984
      ]
    },
    {
      "name": "model.layers.12.self_attn.v_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        1149289984,
        1157678592
      ]
    },
    {
      "name": "model.layers.13.input_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        1157678592,
        1157686784
      ]
    },
    {
      "name": "model.layers.13.mlp.down_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        12288
      ],
      "data_offsets": [
        1157686784,
        1258350080
      ]
    },
    {
      "name": "model.layers.13.mlp.gate_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        1258350080,
        1359013376
      ]
    },
    {
      "name": "model.layers.13.mlp.up_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        1359013376,
        1459676672
      ]
    },
    {
      "name": "model.layers.13.post_attention_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        1459676672,
        1459684864
      ]
    },
    {
      "name": "model.layers.13.self_attn.k_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        1459684864,
        1459685120
      ]
    },
    {
      "name": "model.layers.13.self_attn.k_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        1459685120,
        1468073728
      ]
    },
    {
      "name": "model.layers.13.self_attn.o_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        1468073728,
        1501628160
      ]
    },
    {
      "name": "model.layers.13.self_attn.q_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        1501628160,
        1501628416
      ]
    },
    {
      "name": "model.layers.13.self_attn.q_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        1501628416,
        1535182848
      ]
    },
    {
      "name": "model.layers.13.self_attn.v_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        1535182848,
        1543571456
      ]
    },
    {
      "name": "model.layers.14.input_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        1543571456,
        1543579648
      ]
    },
    {
      "name": "model.layers.14.mlp.down_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        12288
      ],
      "data_offsets": [
        1543579648,
        1644242944
      ]
    },
    {
      "name": "model.layers.14.mlp.gate_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        1644242944,
        1744906240
      ]
    },
    {
      "name": "model.layers.14.mlp.up_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        1744906240,
        1845569536
      ]
    },
    {
      "name": "model.layers.14.post_attention_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        1845569536,
        1845577728
      ]
    },
    {
      "name": "model.layers.14.self_attn.k_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        1845577728,
        1845577984
      ]
    },
    {
      "name": "model.layers.14.self_attn.k_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        1845577984,
        1853966592
      ]
    },
    {
      "name": "model.layers.14.self_attn.o_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        1853966592,
        1887521024
      ]
    },
    {
      "name": "model.layers.14.self_attn.q_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        1887521024,
        1887521280
      ]
    },
    {
      "name": "model.layers.14.self_attn.q_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        1887521280,
        1921075712
      ]
    },
    {
      "name": "model.layers.14.self_attn.v_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        1921075712,
        1929464320
      ]
    },
    {
      "name": "model.layers.15.input_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        1929464320,
        1929472512
      ]
    },
    {
      "name": "model.layers.15.mlp.down_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        12288
      ],
      "data_offsets": [
        1929472512,
        2030135808
      ]
    },
    {
      "name": "model.layers.15.mlp.gate_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        2030135808,
        2130799104
      ]
    },
    {
      "name": "model.layers.15.mlp.up_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        2130799104,
        2231462400
      ]
    },
    {
      "name": "model.layers.15.post_attention_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        2231462400,
        2231470592
      ]
    },
    {
      "name": "model.layers.15.self_attn.k_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        2231470592,
        2231470848
      ]
    },
    {
      "name": "model.layers.15.self_attn.k_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        2231470848,
        2239859456
      ]
    },
    {
      "name": "model.layers.15.self_attn.o_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        2239859456,
        2273413888
      ]
    },
    {
      "name": "model.layers.15.self_attn.q_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        2273413888,
        2273414144
      ]
    },
    {
      "name": "model.layers.15.self_attn.q_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        2273414144,
        2306968576
      ]
    },
    {
      "name": "model.layers.15.self_attn.v_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        2306968576,
        2315357184
      ]
    },
    {
      "name": "model.layers.16.input_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        2315357184,
        2315365376
      ]
    },
    {
      "name": "model.layers.16.mlp.down_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        12288
      ],
      "data_offsets": [
        2315365376,
        2416028672
      ]
    },
    {
      "name": "model.layers.16.mlp.gate_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        2416028672,
        2516691968
      ]
    },
    {
      "name": "model.layers.16.mlp.up_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        2516691968,
        2617355264
      ]
    },
    {
      "name": "model.layers.16.post_attention_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        2617355264,
        2617363456
      ]
    },
    {
      "name": "model.layers.16.self_attn.k_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        2617363456,
        2617363712
      ]
    },
    {
      "name": "model.layers.16.self_attn.k_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        2617363712,
        2625752320
      ]
    },
    {
      "name": "model.layers.16.self_attn.o_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        2625752320,
        2659306752
      ]
    },
    {
      "name": "model.layers.16.self_attn.q_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        2659306752,
        2659307008
      ]
    },
    {
      "name": "model.layers.16.self_attn.q_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        2659307008,
        2692861440
      ]
    },
    {
      "name": "model.layers.16.self_attn.v_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        2692861440,
        2701250048
      ]
    },
    {
      "name": "model.layers.17.mlp.gate_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        2701250048,
        2801913344
      ]
    },
    {
      "name": "model.layers.17.self_attn.k_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        2801913344,
        2801913600
      ]
    },
    {
      "name": "model.layers.17.self_attn.k_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        2801913600,
        2810302208
      ]
    },
    {
      "name": "model.layers.17.self_attn.o_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        2810302208,
        2843856640
      ]
    },
    {
      "name": "model.layers.17.self_attn.q_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        2843856640,
        2843856896
      ]
    },
    {
      "name": "model.layers.17.self_attn.q_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        2843856896,
        2877411328
      ]
    },
    {
      "name": "model.layers.17.self_attn.v_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        2877411328,
        2885799936
      ]
    },
    {
      "name": "model.layers.7.input_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        2885799936,
        2885808128
      ]
    },
    {
      "name": "model.layers.7.mlp.down_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        12288
      ],
      "data_offsets": [
        2885808128,
        2986471424
      ]
    },
    {
      "name": "model.layers.7.mlp.gate_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        2986471424,
        3087134720
      ]
    },
    {
      "name": "model.layers.7.mlp.up_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        3087134720,
        3187798016
      ]
    },
    {
      "name": "model.layers.7.post_attention_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        3187798016,
        3187806208
      ]
    },
    {
      "name": "model.layers.7.self_attn.k_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        3187806208,
        3187806464
      ]
    },
    {
      "name": "model.layers.7.self_attn.o_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        3187806464,
        3221360896
      ]
    },
    {
      "name": "model.layers.7.self_attn.q_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        3221360896,
        3221361152
      ]
    },
    {
      "name": "model.layers.8.input_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        3221361152,
        3221369344
      ]
    },
    {
      "name": "model.layers.8.mlp.down_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        12288
      ],
      "data_offsets": [
        3221369344,
        3322032640
      ]
    },
    {
      "name": "model.layers.8.mlp.gate_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        3322032640,
        3422695936
      ]
    },
    {
      "name": "model.layers.8.mlp.up_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        3422695936,
        3523359232
      ]
    },
    {
      "name": "model.layers.8.post_attention_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        3523359232,
        3523367424
      ]
    },
    {
      "name": "model.layers.8.self_attn.k_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        3523367424,
        3523367680
      ]
    },
    {
      "name": "model.layers.8.self_attn.k_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        3523367680,
        3531756288
      ]
    },
    {
      "name": "model.layers.8.self_attn.o_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        3531756288,
        3565310720
      ]
    },
    {
      "name": "model.layers.8.self_attn.q_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        3565310720,
        3565310976
      ]
    },
    {
      "name": "model.layers.8.self_attn.q_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        3565310976,
        3598865408
      ]
    },
    {
      "name": "model.layers.8.self_attn.v_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        3598865408,
        3607254016
      ]
    },
    {
      "name": "model.layers.9.input_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        3607254016,
        3607262208
      ]
    },
    {
      "name": "model.layers.9.mlp.down_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        12288
      ],
      "data_offsets": [
        3607262208,
        3707925504
      ]
    },
    {
      "name": "model.layers.9.mlp.gate_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        3707925504,
        3808588800
      ]
    },
    {
      "name": "model.layers.9.mlp.up_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        3808588800,
        3909252096
      ]
    },
    {
      "name": "model.layers.9.post_attention_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        3909252096,
        3909260288
      ]
    },
    {
      "name": "model.layers.9.self_attn.k_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        3909260288,
        3909260544
      ]
    },
    {
      "name": "model.layers.9.self_attn.k_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        3909260544,
        3917649152
      ]
    },
    {
      "name": "model.layers.9.self_attn.o_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        3917649152,
        3951203584
      ]
    },
    {
      "name": "model.layers.9.self_attn.q_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        3951203584,
        3951203840
      ]
    },
    {
      "name": "model.layers.9.self_attn.q_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        3951203840,
        3984758272
      ]
    },
    {
      "name": "model.layers.9.self_attn.v_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        3984758272,
        3993146880
      ]
    },
    {
      "name": "model.layers.17.input_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        0,
        8192
      ]
    },
    {
      "name": "model.layers.17.mlp.down_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        12288
      ],
      "data_offsets": [
        8192,
        100671488
      ]
    },
    {
      "name": "model.layers.17.mlp.up_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        100671488,
        201334784
      ]
    },
    {
      "name": "model.layers.17.post_attention_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        201334784,
        201342976
      ]
    },
    {
      "name": "model.layers.18.input_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        201342976,
        201351168
      ]
    },
    {
      "name": "model.layers.18.mlp.down_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        12288
      ],
      "data_offsets": [
        201351168,
        302014464
      ]
    },
    {
      "name": "model.layers.18.mlp.gate_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        302014464,
        402677760
      ]
    },
    {
      "name": "model.layers.18.mlp.up_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        402677760,
        503341056
      ]
    },
    {
      "name": "model.layers.18.post_attention_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        503341056,
        503349248
      ]
    },
    {
      "name": "model.layers.18.self_attn.k_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        503349248,
        503349504
      ]
    },
    {
      "name": "model.layers.18.self_attn.k_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        503349504,
        511738112
      ]
    },
    {
      "name": "model.layers.18.self_attn.o_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        511738112,
        545292544
      ]
    },
    {
      "name": "model.layers.18.self_attn.q_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        545292544,
        545292800
      ]
    },
    {
      "name": "model.layers.18.self_attn.q_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        545292800,
        578847232
      ]
    },
    {
      "name": "model.layers.18.self_attn.v_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        578847232,
        587235840
      ]
    },
    {
      "name": "model.layers.19.input_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        587235840,
        587244032
      ]
    },
    {
      "name": "model.layers.19.mlp.down_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        12288
      ],
      "data_offsets": [
        587244032,
        687907328
      ]
    },
    {
      "name": "model.layers.19.mlp.gate_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        687907328,
        788570624
      ]
    },
    {
      "name": "model.layers.19.mlp.up_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        788570624,
        889233920
      ]
    },
    {
      "name": "model.layers.19.post_attention_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        889233920,
        889242112
      ]
    },
    {
      "name": "model.layers.19.self_attn.k_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        889242112,
        889242368
      ]
    },
    {
      "name": "model.layers.19.self_attn.k_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        889242368,
        897630976
      ]
    },
    {
      "name": "model.layers.19.self_attn.o_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        897630976,
        931185408
      ]
    },
    {
      "name": "model.layers.19.self_attn.q_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        931185408,
        931185664
      ]
    },
    {
      "name": "model.layers.19.self_attn.q_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        931185664,
        964740096
      ]
    },
    {
      "name": "model.layers.19.self_attn.v_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        964740096,
        973128704
      ]
    },
    {
      "name": "model.layers.20.input_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        973128704,
        973136896
      ]
    },
    {
      "name": "model.layers.20.mlp.down_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        12288
      ],
      "data_offsets": [
        973136896,
        1073800192
      ]
    },
    {
      "name": "model.layers.20.mlp.gate_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        1073800192,
        1174463488
      ]
    },
    {
      "name": "model.layers.20.mlp.up_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        1174463488,
        1275126784
      ]
    },
    {
      "name": "model.layers.20.post_attention_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        1275126784,
        1275134976
      ]
    },
    {
      "name": "model.layers.20.self_attn.k_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        1275134976,
        1275135232
      ]
    },
    {
      "name": "model.layers.20.self_attn.k_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        1275135232,
        1283523840
      ]
    },
    {
      "name": "model.layers.20.self_attn.o_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        1283523840,
        1317078272
      ]
    },
    {
      "name": "model.layers.20.self_attn.q_norm.weight",
      "dtype": "BF16",
      "shape": [
        128
      ],
      "data_offsets": [
        1317078272,
        1317078528
      ]
    },
    {
      "name": "model.layers.20.self_attn.q_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        4096
      ],
      "data_offsets": [
        1317078528,
        1350632960
      ]
    },
    {
      "name": "model.layers.20.self_attn.v_proj.weight",
      "dtype": "BF16",
      "shape": [
        1024,
        4096
      ],
      "data_offsets": [
        1350632960,
        1359021568
      ]
    },
    {
      "name": "model.layers.21.input_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        1359021568,
        1359029760
      ]
    },
    {
      "name": "model.layers.21.mlp.down_proj.weight",
      "dtype": "BF16",
      "shape": [
        4096,
        12288
      ],
      "data_offsets": [
        1359029760,
        1459693056
      ]
    },
    {
      "name": "model.layers.21.mlp.gate_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        1459693056,
        1560356352
      ]
    },
    {
      "name": "model.layers.21.mlp.up_proj.weight",
      "dtype": "BF16",
      "shape": [
        12288,
        4096
      ],
      "data_offsets": [
        1560356352,
        1661019648
      ]
    },
    {
      "name": "model.layers.21.post_attention_layernorm.weight",
      "dtype": "BF16",
      "shape": [
        4096
      ],
      "data_offsets": [
        1661019648,
        1661027840
      ]
    },
    {
      "name": "model.layers.21.self_attn.k_norm.weight",
